MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAR169/mcu.h
extern volatile __IEC4bits_t IEC4bits __asm__ ("IEC4") __attribute__((section("sfrs"), address(0xBF810100)));
extern volatile uint32_t        IEC4CLR __attribute__((section("sfrs"),address(0xBF810104)));
extern volatile uint32_t        IEC4SET __attribute__((section("sfrs"),address(0xBF810108)));
extern volatile uint32_t        IEC4INV __attribute__((section("sfrs"),address(0xBF81010C)));
#define IEC5 IEC5
extern volatile uint32_t   IEC5 __attribute__((section("sfrs"), address(0xBF810110)));
typedef union {
  struct {
    uint32_t I2C3BIE:1;
    uint32_t I2C3SIE:1;
    uint32_t I2C3MIE:1;
    uint32_t SPI4EIE:1;
    uint32_t SPI4RXIE:1;
    uint32_t SPI4TXIE:1;
    uint32_t RTCCIE:1;
    uint32_t FCEIE:1;
    uint32_t PREIE:1;
    uint32_t SQI1IE:1;
    uint32_t U4EIE:1;
    uint32_t U4RXIE:1;
    uint32_t U4TXIE:1;
    uint32_t I2C4BIE:1;
    uint32_t I2C4SIE:1;
    uint32_t I2C4MIE:1;
    uint32_t SPI5EIE:1;
    uint32_t SPI5RXIE:1;
    uint32_t SPI5TXIE:1;
    uint32_t U5EIE:1;
    uint32_t U5RXIE:1;
    uint32_t U5TXIE:1;
    uint32_t I2C5BIE:1;
    uint32_t I2C5SIE:1;
    uint32_t I2C5MIE:1;
    uint32_t SPI6IE:1;
    uint32_t SPI6RXIE:1;
    uint32_t SPI6TXIE:1;
    uint32_t U6EIE:1;
    uint32_t U6RXIE:1;
    uint32_t U6TXIE:1;
    uint32_t SDHCIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __IEC5bits_t;
extern volatile __IEC5bits_t IEC5bits __asm__ ("IEC5") __attribute__((section("sfrs"), address(0xBF810110)));
extern volatile uint32_t        IEC5CLR __attribute__((section("sfrs"),address(0xBF810114)));
extern volatile uint32_t        IEC5SET __attribute__((section("sfrs"),address(0xBF810118)));
extern volatile uint32_t        IEC5INV __attribute__((section("sfrs"),address(0xBF81011C)));
#define IEC6 IEC6
extern volatile uint32_t   IEC6 __attribute__((section("sfrs"), address(0xBF810120)));
typedef union {
  struct {
    uint32_t GLCDIE:1;
    uint32_t GPUIE:1;
    uint32_t :1;
    uint32_t CTMUIE:1;
    uint32_t ADCEOSIE:1;
    uint32_t ADCARDYIE:1;
    uint32_t ADCURDYIE:1;
    uint32_t ADC0EIE:1;
    uint32_t ADC1EIE:1;
    uint32_t ADC2EIE:1;
    uint32_t ADC3EIE:1;
    uint32_t ADC4EIE:1;
    uint32_t :1;
    uint32_t ADCGRPIE:1;
    uint32_t ADC7EIE:1;
    uint32_t ADC0WIE:1;
    uint32_t ADC1WIE:1;
    uint32_t ADC2WIE:1;
    uint32_t ADC3WIE:1;
    uint32_t ADC4WIE:1;
    uint32_t :2;
    uint32_t ADC7WIE:1;
    uint32_t MPLLFLTIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __IEC6bits_t;
extern volatile __IEC6bits_t IEC6bits __asm__ ("IEC6") __attribute__((section("sfrs"), address(0xBF810120)));
extern volatile uint32_t        IEC6CLR __attribute__((section("sfrs"),address(0xBF810124)));
extern volatile uint32_t        IEC6SET __attribute__((section("sfrs"),address(0xBF810128)));
extern volatile uint32_t        IEC6INV __attribute__((section("sfrs"),address(0xBF81012C)));
#define IPC0 IPC0
extern volatile uint32_t   IPC0 __attribute__((section("sfrs"), address(0xBF810140)));
typedef union {
  struct {
    uint32_t CTIS:2;
    uint32_t CTIP:3;
    uint32_t :3;
    uint32_t CS0IS:2;
    uint32_t CS0IP:3;
    uint32_t :3;
    uint32_t CS1IS:2;
    uint32_t CS1IP:3;
    uint32_t :3;
    uint32_t INT0IS:2;
    uint32_t INT0IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC0bits_t;
extern volatile __IPC0bits_t IPC0bits __asm__ ("IPC0") __attribute__((section("sfrs"), address(0xBF810140)));
extern volatile uint32_t        IPC0CLR __attribute__((section("sfrs"),address(0xBF810144)));
extern volatile uint32_t        IPC0SET __attribute__((section("sfrs"),address(0xBF810148)));
extern volatile uint32_t        IPC0INV __attribute__((section("sfrs"),address(0xBF81014C)));
#define IPC1 IPC1
extern volatile uint32_t   IPC1 __attribute__((section("sfrs"), address(0xBF810150)));
typedef union {
  struct {
    uint32_t T1IS:2;
    uint32_t T1IP:3;
    uint32_t :3;
    uint32_t IC1EIS:2;
    uint32_t IC1EIP:3;
    uint32_t :3;
    uint32_t IC1IS:2;
    uint32_t IC1IP:3;
    uint32_t :3;
    uint32_t OC1IS:2;
    uint32_t OC1IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC1bits_t;
extern volatile __IPC1bits_t IPC1bits __asm__ ("IPC1") __attribute__((section("sfrs"), address(0xBF810150)));
extern volatile uint32_t        IPC1CLR __attribute__((section("sfrs"),address(0xBF810154)));
extern volatile uint32_t        IPC1SET __attribute__((section("sfrs"),address(0xBF810158)));
extern volatile uint32_t        IPC1INV __attribute__((section("sfrs"),address(0xBF81015C)));
#define IPC2 IPC2
extern volatile uint32_t   IPC2 __attribute__((section("sfrs"), address(0xBF810160)));
typedef union {
  struct {
    uint32_t INT1IS:2;
    uint32_t INT1IP:3;
    uint32_t :3;
    uint32_t T2IS:2;
    uint32_t T2IP:3;
    uint32_t :3;
    uint32_t IC2EIS:2;
    uint32_t IC2EIP:3;
    uint32_t :3;
    uint32_t IC2IS:2;
    uint32_t IC2IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC2bits_t;
extern volatile __IPC2bits_t IPC2bits __asm__ ("IPC2") __attribute__((section("sfrs"), address(0xBF810160)));
extern volatile uint32_t        IPC2CLR __attribute__((section("sfrs"),address(0xBF810164)));
extern volatile uint32_t        IPC2SET __attribute__((section("sfrs"),address(0xBF810168)));
extern volatile uint32_t        IPC2INV __attribute__((section("sfrs"),address(0xBF81016C)));
#define IPC3 IPC3
extern volatile uint32_t   IPC3 __attribute__((section("sfrs"), address(0xBF810170)));
typedef union {
  struct {
    uint32_t OC2IS:2;
    uint32_t OC2IP:3;
    uint32_t :3;
    uint32_t INT2IS:2;
    uint32_t INT2IP:3;
    uint32_t :3;
    uint32_t T3IS:2;
    uint32_t T3IP:3;
    uint32_t :3;
    uint32_t IC3EIS:2;
    uint32_t IC3EIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC3bits_t;
extern volatile __IPC3bits_t IPC3bits __asm__ ("IPC3") __attribute__((section("sfrs"), address(0xBF810170)));
extern volatile uint32_t        IPC3CLR __attribute__((section("sfrs"),address(0xBF810174)));
extern volatile uint32_t        IPC3SET __attribute__((section("sfrs"),address(0xBF810178)));
extern volatile uint32_t        IPC3INV __attribute__((section("sfrs"),address(0xBF81017C)));
#define IPC4 IPC4
extern volatile uint32_t   IPC4 __attribute__((section("sfrs"), address(0xBF810180)));
typedef union {
  struct {
    uint32_t IC3IS:2;
    uint32_t IC3IP:3;
    uint32_t :3;
    uint32_t OC3IS:2;
    uint32_t OC3IP:3;
    uint32_t :3;
    uint32_t INT3IS:2;
    uint32_t INT3IP:3;
    uint32_t :3;
    uint32_t T4IS:2;
    uint32_t T4IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC4bits_t;
