MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAR169/mcu.h
extern volatile __ADCDATA16bits_t ADCDATA16bits __asm__ ("ADCDATA16") __attribute__((section("sfrs"), address(0xBF84BA40)));
#define ADCDATA17 ADCDATA17
extern volatile uint32_t   ADCDATA17 __attribute__((section("sfrs"), address(0xBF84BA44)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA17bits_t;
extern volatile __ADCDATA17bits_t ADCDATA17bits __asm__ ("ADCDATA17") __attribute__((section("sfrs"), address(0xBF84BA44)));
#define ADCDATA18 ADCDATA18
extern volatile uint32_t   ADCDATA18 __attribute__((section("sfrs"), address(0xBF84BA48)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA18bits_t;
extern volatile __ADCDATA18bits_t ADCDATA18bits __asm__ ("ADCDATA18") __attribute__((section("sfrs"), address(0xBF84BA48)));
#define ADCDATA19 ADCDATA19
extern volatile uint32_t   ADCDATA19 __attribute__((section("sfrs"), address(0xBF84BA4C)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA19bits_t;
extern volatile __ADCDATA19bits_t ADCDATA19bits __asm__ ("ADCDATA19") __attribute__((section("sfrs"), address(0xBF84BA4C)));
#define ADCDATA20 ADCDATA20
extern volatile uint32_t   ADCDATA20 __attribute__((section("sfrs"), address(0xBF84BA50)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA20bits_t;
extern volatile __ADCDATA20bits_t ADCDATA20bits __asm__ ("ADCDATA20") __attribute__((section("sfrs"), address(0xBF84BA50)));
#define ADCDATA21 ADCDATA21
extern volatile uint32_t   ADCDATA21 __attribute__((section("sfrs"), address(0xBF84BA54)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA21bits_t;
extern volatile __ADCDATA21bits_t ADCDATA21bits __asm__ ("ADCDATA21") __attribute__((section("sfrs"), address(0xBF84BA54)));
#define ADCDATA22 ADCDATA22
extern volatile uint32_t   ADCDATA22 __attribute__((section("sfrs"), address(0xBF84BA58)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA22bits_t;
extern volatile __ADCDATA22bits_t ADCDATA22bits __asm__ ("ADCDATA22") __attribute__((section("sfrs"), address(0xBF84BA58)));
#define ADCDATA23 ADCDATA23
extern volatile uint32_t   ADCDATA23 __attribute__((section("sfrs"), address(0xBF84BA5C)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA23bits_t;
extern volatile __ADCDATA23bits_t ADCDATA23bits __asm__ ("ADCDATA23") __attribute__((section("sfrs"), address(0xBF84BA5C)));
#define ADCDATA24 ADCDATA24
extern volatile uint32_t   ADCDATA24 __attribute__((section("sfrs"), address(0xBF84BA60)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA24bits_t;
extern volatile __ADCDATA24bits_t ADCDATA24bits __asm__ ("ADCDATA24") __attribute__((section("sfrs"), address(0xBF84BA60)));
#define ADCDATA25 ADCDATA25
extern volatile uint32_t   ADCDATA25 __attribute__((section("sfrs"), address(0xBF84BA64)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA25bits_t;
extern volatile __ADCDATA25bits_t ADCDATA25bits __asm__ ("ADCDATA25") __attribute__((section("sfrs"), address(0xBF84BA64)));
#define ADCDATA26 ADCDATA26
extern volatile uint32_t   ADCDATA26 __attribute__((section("sfrs"), address(0xBF84BA68)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA26bits_t;
extern volatile __ADCDATA26bits_t ADCDATA26bits __asm__ ("ADCDATA26") __attribute__((section("sfrs"), address(0xBF84BA68)));
#define ADCDATA27 ADCDATA27
extern volatile uint32_t   ADCDATA27 __attribute__((section("sfrs"), address(0xBF84BA6C)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA27bits_t;
extern volatile __ADCDATA27bits_t ADCDATA27bits __asm__ ("ADCDATA27") __attribute__((section("sfrs"), address(0xBF84BA6C)));
#define ADCDATA28 ADCDATA28
extern volatile uint32_t   ADCDATA28 __attribute__((section("sfrs"), address(0xBF84BA70)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA28bits_t;
extern volatile __ADCDATA28bits_t ADCDATA28bits __asm__ ("ADCDATA28") __attribute__((section("sfrs"), address(0xBF84BA70)));
#define ADCDATA29 ADCDATA29
extern volatile uint32_t   ADCDATA29 __attribute__((section("sfrs"), address(0xBF84BA74)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA29bits_t;
extern volatile __ADCDATA29bits_t ADCDATA29bits __asm__ ("ADCDATA29") __attribute__((section("sfrs"), address(0xBF84BA74)));
#define ADCDATA30 ADCDATA30
extern volatile uint32_t   ADCDATA30 __attribute__((section("sfrs"), address(0xBF84BA78)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA30bits_t;
extern volatile __ADCDATA30bits_t ADCDATA30bits __asm__ ("ADCDATA30") __attribute__((section("sfrs"), address(0xBF84BA78)));
#define ADCDATA31 ADCDATA31
extern volatile uint32_t   ADCDATA31 __attribute__((section("sfrs"), address(0xBF84BA7C)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA31bits_t;
extern volatile __ADCDATA31bits_t ADCDATA31bits __asm__ ("ADCDATA31") __attribute__((section("sfrs"), address(0xBF84BA7C)));
#define ADCDATA32 ADCDATA32
extern volatile uint32_t   ADCDATA32 __attribute__((section("sfrs"), address(0xBF84BA80)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA32bits_t;
extern volatile __ADCDATA32bits_t ADCDATA32bits __asm__ ("ADCDATA32") __attribute__((section("sfrs"), address(0xBF84BA80)));
#define ADCDATA33 ADCDATA33
extern volatile uint32_t   ADCDATA33 __attribute__((section("sfrs"), address(0xBF84BA84)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA33bits_t;
extern volatile __ADCDATA33bits_t ADCDATA33bits __asm__ ("ADCDATA33") __attribute__((section("sfrs"), address(0xBF84BA84)));
#define ADCDATA34 ADCDATA34
extern volatile uint32_t   ADCDATA34 __attribute__((section("sfrs"), address(0xBF84BA88)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA34bits_t;
extern volatile __ADCDATA34bits_t ADCDATA34bits __asm__ ("ADCDATA34") __attribute__((section("sfrs"), address(0xBF84BA88)));
#define ADCDATA35 ADCDATA35
extern volatile uint32_t   ADCDATA35 __attribute__((section("sfrs"), address(0xBF84BA8C)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA35bits_t;
extern volatile __ADCDATA35bits_t ADCDATA35bits __asm__ ("ADCDATA35") __attribute__((section("sfrs"), address(0xBF84BA8C)));
#define ADCDATA36 ADCDATA36
extern volatile uint32_t   ADCDATA36 __attribute__((section("sfrs"), address(0xBF84BA90)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA36bits_t;
extern volatile __ADCDATA36bits_t ADCDATA36bits __asm__ ("ADCDATA36") __attribute__((section("sfrs"), address(0xBF84BA90)));
#define ADCDATA37 ADCDATA37
extern volatile uint32_t   ADCDATA37 __attribute__((section("sfrs"), address(0xBF84BA94)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA37bits_t;
