MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAR169/mcu.h
extern volatile __C1FIFOCI22bits_t C1FIFOCI22bits __asm__ ("C1FIFOCI22") __attribute__((section("sfrs"), address(0xBF880900)));
extern volatile uint32_t        C1FIFOCI22CLR __attribute__((section("sfrs"),address(0xBF880904)));
extern volatile uint32_t        C1FIFOCI22SET __attribute__((section("sfrs"),address(0xBF880908)));
extern volatile uint32_t        C1FIFOCI22INV __attribute__((section("sfrs"),address(0xBF88090C)));
#define C1FIFOCON23 C1FIFOCON23
extern volatile uint32_t   C1FIFOCON23 __attribute__((section("sfrs"), address(0xBF880910)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON23bits_t;
extern volatile __C1FIFOCON23bits_t C1FIFOCON23bits __asm__ ("C1FIFOCON23") __attribute__((section("sfrs"), address(0xBF880910)));
extern volatile uint32_t        C1FIFOCON23CLR __attribute__((section("sfrs"),address(0xBF880914)));
extern volatile uint32_t        C1FIFOCON23SET __attribute__((section("sfrs"),address(0xBF880918)));
extern volatile uint32_t        C1FIFOCON23INV __attribute__((section("sfrs"),address(0xBF88091C)));
#define C1FIFOINT23 C1FIFOINT23
extern volatile uint32_t   C1FIFOINT23 __attribute__((section("sfrs"), address(0xBF880920)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT23bits_t;
extern volatile __C1FIFOINT23bits_t C1FIFOINT23bits __asm__ ("C1FIFOINT23") __attribute__((section("sfrs"), address(0xBF880920)));
extern volatile uint32_t        C1FIFOINT23CLR __attribute__((section("sfrs"),address(0xBF880924)));
extern volatile uint32_t        C1FIFOINT23SET __attribute__((section("sfrs"),address(0xBF880928)));
extern volatile uint32_t        C1FIFOINT23INV __attribute__((section("sfrs"),address(0xBF88092C)));
#define C1FIFOUA23 C1FIFOUA23
extern volatile uint32_t   C1FIFOUA23 __attribute__((section("sfrs"), address(0xBF880930)));
extern volatile uint32_t        C1FIFOUA23CLR __attribute__((section("sfrs"),address(0xBF880934)));
extern volatile uint32_t        C1FIFOUA23SET __attribute__((section("sfrs"),address(0xBF880938)));
extern volatile uint32_t        C1FIFOUA23INV __attribute__((section("sfrs"),address(0xBF88093C)));
#define C1FIFOCI23 C1FIFOCI23
extern volatile uint32_t   C1FIFOCI23 __attribute__((section("sfrs"), address(0xBF880940)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI23bits_t;
extern volatile __C1FIFOCI23bits_t C1FIFOCI23bits __asm__ ("C1FIFOCI23") __attribute__((section("sfrs"), address(0xBF880940)));
extern volatile uint32_t        C1FIFOCI23CLR __attribute__((section("sfrs"),address(0xBF880944)));
extern volatile uint32_t        C1FIFOCI23SET __attribute__((section("sfrs"),address(0xBF880948)));
extern volatile uint32_t        C1FIFOCI23INV __attribute__((section("sfrs"),address(0xBF88094C)));
#define C1FIFOCON24 C1FIFOCON24
extern volatile uint32_t   C1FIFOCON24 __attribute__((section("sfrs"), address(0xBF880950)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON24bits_t;
extern volatile __C1FIFOCON24bits_t C1FIFOCON24bits __asm__ ("C1FIFOCON24") __attribute__((section("sfrs"), address(0xBF880950)));
extern volatile uint32_t        C1FIFOCON24CLR __attribute__((section("sfrs"),address(0xBF880954)));
extern volatile uint32_t        C1FIFOCON24SET __attribute__((section("sfrs"),address(0xBF880958)));
extern volatile uint32_t        C1FIFOCON24INV __attribute__((section("sfrs"),address(0xBF88095C)));
#define C1FIFOINT24 C1FIFOINT24
extern volatile uint32_t   C1FIFOINT24 __attribute__((section("sfrs"), address(0xBF880960)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT24bits_t;
extern volatile __C1FIFOINT24bits_t C1FIFOINT24bits __asm__ ("C1FIFOINT24") __attribute__((section("sfrs"), address(0xBF880960)));
extern volatile uint32_t        C1FIFOINT24CLR __attribute__((section("sfrs"),address(0xBF880964)));
extern volatile uint32_t        C1FIFOINT24SET __attribute__((section("sfrs"),address(0xBF880968)));
extern volatile uint32_t        C1FIFOINT24INV __attribute__((section("sfrs"),address(0xBF88096C)));
#define C1FIFOUA24 C1FIFOUA24
extern volatile uint32_t   C1FIFOUA24 __attribute__((section("sfrs"), address(0xBF880970)));
extern volatile uint32_t        C1FIFOUA24CLR __attribute__((section("sfrs"),address(0xBF880974)));
extern volatile uint32_t        C1FIFOUA24SET __attribute__((section("sfrs"),address(0xBF880978)));
extern volatile uint32_t        C1FIFOUA24INV __attribute__((section("sfrs"),address(0xBF88097C)));
#define C1FIFOCI24 C1FIFOCI24
extern volatile uint32_t   C1FIFOCI24 __attribute__((section("sfrs"), address(0xBF880980)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI24bits_t;
extern volatile __C1FIFOCI24bits_t C1FIFOCI24bits __asm__ ("C1FIFOCI24") __attribute__((section("sfrs"), address(0xBF880980)));
extern volatile uint32_t        C1FIFOCI24CLR __attribute__((section("sfrs"),address(0xBF880984)));
extern volatile uint32_t        C1FIFOCI24SET __attribute__((section("sfrs"),address(0xBF880988)));
extern volatile uint32_t        C1FIFOCI24INV __attribute__((section("sfrs"),address(0xBF88098C)));
#define C1FIFOCON25 C1FIFOCON25
extern volatile uint32_t   C1FIFOCON25 __attribute__((section("sfrs"), address(0xBF880990)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON25bits_t;
extern volatile __C1FIFOCON25bits_t C1FIFOCON25bits __asm__ ("C1FIFOCON25") __attribute__((section("sfrs"), address(0xBF880990)));
extern volatile uint32_t        C1FIFOCON25CLR __attribute__((section("sfrs"),address(0xBF880994)));
extern volatile uint32_t        C1FIFOCON25SET __attribute__((section("sfrs"),address(0xBF880998)));
extern volatile uint32_t        C1FIFOCON25INV __attribute__((section("sfrs"),address(0xBF88099C)));
#define C1FIFOINT25 C1FIFOINT25
extern volatile uint32_t   C1FIFOINT25 __attribute__((section("sfrs"), address(0xBF8809A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT25bits_t;
